aethaniel/emBlocks_sam_patch/share/em_armgcc/lib/atmel/atsam4/atsam4l/include/component/component_flashcalw.h
#define SCIF_FUSES_BOD18LV_ADDR     HFLASHC_USER
#define SCIF_FUSES_BOD18LV_Pos      11           /**< \brief (HFLASHC_USER) BOD18 Level */
#define SCIF_FUSES_BOD18LV_Msk      (0x3Fu << SCIF_FUSES_BOD18LV_Pos)
#define SCIF_FUSES_BOD18LV(value)   ((SCIF_FUSES_BOD18LV_Msk & ((value) << SCIF_FUSES_BOD18LV_Pos)))

#define SCIF_FUSES_BOD33ACTION_ADDR HFLASHC_USER
#define SCIF_FUSES_BOD33ACTION_Pos  8            /**< \brief (HFLASHC_USER) BOD33 Action */
#define SCIF_FUSES_BOD33ACTION_Msk  (0x3u << SCIF_FUSES_BOD33ACTION_Pos)
#define SCIF_FUSES_BOD33ACTION(value) ((SCIF_FUSES_BOD33ACTION_Msk & ((value) << SCIF_FUSES_BOD33ACTION_Pos)))

#define SCIF_FUSES_BOD33EN_ADDR     HFLASHC_USER
#define SCIF_FUSES_BOD33EN_Pos      7            /**< \brief (HFLASHC_USER) BOD33 Enable */
#define SCIF_FUSES_BOD33EN_Msk      (0x1u << SCIF_FUSES_BOD33EN_Pos)

#define SCIF_FUSES_BOD33LEVEL_ADDR  HFLASHC_USER
#define SCIF_FUSES_BOD33LEVEL_Pos   1            /**< \brief (HFLASHC_USER) BOD33 Level */
#define SCIF_FUSES_BOD33LEVEL_Msk   (0x3Fu << SCIF_FUSES_BOD33LEVEL_Pos)
#define SCIF_FUSES_BOD33LEVEL(value) ((SCIF_FUSES_BOD33LEVEL_Msk & ((value) << SCIF_FUSES_BOD33LEVEL_Pos)))

#define SCIF_FUSES_BOD33_HYST_ADDR  HFLASHC_USER
#define SCIF_FUSES_BOD33_HYST_Pos   10           /**< \brief (HFLASHC_USER) BOD33 Hysteresis */
#define SCIF_FUSES_BOD33_HYST_Msk   (0x1u << SCIF_FUSES_BOD33_HYST_Pos)

#define WDT_FUSES_WDTAUTO_ADDR      HFLASHC_USER
#define WDT_FUSES_WDTAUTO_Pos       0            /**< \brief (HFLASHC_USER) Watchdog Enabled at Reset */
#define WDT_FUSES_WDTAUTO_Msk       (0x1u << WDT_FUSES_WDTAUTO_Pos)

/*@}*/

#endif /* _SAM4L_FLASHCALW_COMPONENT_ */
